Autodesk.Revit.DB.Structure.RebarBendingDetailType.CreateRealistic(Autodesk.Revit.DB.Document)
Creates a new RebarBendingDetailType object for full representations.
Document:
Document to which the new element should be added.
Returns:
The new RebarBendingDetailType object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.CreateSchematic(Autodesk.Revit.DB.Document)
Creates a new RebarBendingDetailType object for schematic representations.
Document:
Document to which the new element should be added.
Returns:
The new RebarBendingDetailType object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.DisplayMode
The display mode for the bending detail.
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetailType.TagTypeId
Identifies the Id of the tag type which is used in the Bending Detail representation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SchematicHeight
Determine the height of the box where the schematic Bending Detail will be represented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for schematicHeight must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SchematicWidth
Determine the width of the box where the schematic Bending Detail will be represented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for schematicWidth must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2025